app/views/users/index.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 4]]
---
                </li>
                    <li><small><%= pluralize(user.articles.count, "article") if user.articles %></small>