app/controllers/articles_controller.rb

    def update
        @article = Article.find(params[:id])
        if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "I am geting there  ayy"], ["updated_at", "2023-01-18 00:04:36.653352"], ["id", 6]]

    def create
        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)